National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getMt910RequestMt102 xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>OcsZr7fPSvDJN8cj3USMXGEKqPn3prQiOOpv6UpqKte4tFUbcY/jrQg0xXli4iTHS8a6Dln7B6fI&#13;
5pDEtMfGkeHUQZAURxeL2GmI06mTnPDRFMTMH7iESyxbDF6CgAZ4s+eTwfkELn7cp1iM9j2NRJcr&#13;
2AdKDEjv/OwGXejdaUmDP7y24kOjWAclCR3VEzj31fE+xGJpEbGeUlnB5Ww1AhftNBh9jIGJmZPa&#13;
wkGrx+Y38ZxwQ5HOZLbbotX2CG8fiHdEq4gD7OFsXL2A9PzoS7n8PhIqzZy05yJc1I5wXoyNXl6G&#13;
X0NMU3r3agXPQaxN9Wp6e2vSiFlauxIA3n2Ecw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>NcddqLWfcxttUpQ0Up7IqMsnYQ/TkcGIYSpYlJdj71aZFXhOmnZBGHsXqDzenTDIXqKe/YFzMFcV&#13;
JiIyOVXlo8v4ywTOGYhYuqoIdGSn5T0o6sLzbBXkFP5JNYzhtHtj03c6XhxlwD2TarwtFiOKhEi9&#13;
5uLU3trdxRagKX6anNOHgHThCwT0/IPaYf0cJrOLwBZ8acPsVY0gV+5x+rWIJEQgJhySVOgt0ljJ&#13;
BjqfGAAwSasGQdskQ9H4RiA1zcckXREg8DEvdN+qDHNPEOUpUqMG+yHyTTTC+4V9P3i1I517lErS&#13;
HtxFO+6zfwXr7Va2/Vs6RXRKy9qm8QW5ATEcj427HLSu9cgd43UQaINs4jFbwl/iNBLXL6SCzZNz&#13;
xDJ+TY2dGTUbWNroiCFncGlo8MZcTUJYhruHRjp6lu/Wml+nj2GqZtkiV8gjnOVoACbm+ZWgiqgg&#13;
5GLAKMVyh2EBUp+bpaYLV/h+vftyaSYG4dGwr2nvM7TQgDw2zHy/O/MhRTq2zqG4OmAO46g+1nF7&#13;
W7WZHtkj9jR5hFgFIajDN0jbUIc8T0rPv3ch8mB88Ir/yNi1roFZ8le/T2yt86ozDNlt30zQv6B6&#13;
fdRSmR8BAUghFWx5NDX4d7EQwh9KXFH2H27/JYO7FTYv2hj2Qm4z/CVOoEZBq8pQApzsA0W/nEJQ&#13;
ZfUYU2btYND9kOww79y2HU/cxNMm2PReLArAOGskKkCJNTjOSc2inmf9RocXfGmd/BHFiuLA5udV&#13;
c9GhRXUjHXQZhOmssPxzOZ/V7hCe+GFlVcGa+0zy3cIr3eyWMl+1mvyzQKV2u+JC6m/y4q8U4caP&#13;
dx/FHb1ccrGrF07KFMcZiU/y/FxKRAz1rJN3AVlOktyhS1fwOiYLVgpM6nHhbw09SzynaMtTzLOu&#13;
I/fYzODkRTeQERIW7XPJBB01UadEcht6R0ieAMDgXfAZy4bySNT9ddE+l/Ughfa9+5+RhCK/MfWx&#13;
EAg00OuYU568UmzfRMKgeRmBAQeW9q7REEjyUqcb3E32PbNDAlzmSl8SC1F6C2svfMednDA2sRYk&#13;
tFl2FqAaqjGMBKjPDhe7xEKkBvnctaT+O3LS33fRlXScEeRNGH5TaCcRG0TdKefkanaPHbbFnsFB&#13;
Bw6c5hEwQMOZ3UHP9yELDFwLhS80lvHjeAe8dhEfPe+GFaD894+2VIInAhEWIkC3DoBVGftaWoZ6&#13;
ZZMG54inj4eIuHwIjqdrHHFL6H+1s5UgJheyFctDKRy/e7oIk2a1kFRp8/KcPaXtidu5N57A6iJk&#13;
HsWNRNx604bmIfj5tSaU72PzMlYkPEiw2fdoVC5LtGcjRKTzo0/uOjt82FZz9iNc0l52Fn5mvbFZ&#13;
ubAzuUWoHGSXcsLOrorsOlKbCMYTQC/riYF7x9wMORZs2TJB1nypT63CFhFrk61OxQjdsg50u4pA&#13;
gNr6lMERhuqbGt2lhPQOpWmYLJ1iCckBmIXWg0Km+ms/bp34/CwjBd4WFytHhdteSJAG+K6g1Oc5&#13;
F4+cMc7Nw+1XiSHYgDBqPS7gta7wJH8EYOt23/YQz2ri7Slz4DlvMlPZX51QT4MLg3gtei0n6nMt&#13;
1fstbmrEAzmz0oLZL8MBWK7UJtkt+LYT0/wr/FsOzG5YqbzugnF8rZo1KWCrTHqUpJ3AIpTdXqtH&#13;
9RwxxuZ+WVHdB2GglKVrUKsAJD9ByqCnUYx0EDYJBPwub6i/Kgmz4otrSJ/X4CKqILV+kKpj7w+a&#13;
wDX3Yjz9HHn5Hy6mJ7Bi3BlDvCxAGw24a0Ay0hfINOavdB7CvwNwv6bRqXIyeifh2iqiRLfYM+px&#13;
3o5TRWAqgRPDQkHK0RX4QbxEFqfcLbFIYJ1Ip+VLObeRLDIoNVJZkTS0TwNaZwCAEe6nkdf8xDPG&#13;
+o47KL5nakCgXBKtTyGjVN7wZ9x+otTqCOPzTCW1CfefVhY186G4CRlOLmGr1D9w3HORO217pk8W&#13;
HnQLejYlgxNdSACgE8us1IFdGD8t7fleGhK3Y4iaFr4j9jFtIwnE3Kf3Q0XSHW3G2VwKBAVofrzW&#13;
Pii/pnoZc3nnoXBx5YehvndF6oWsTzsAFD6OiN4lRnXs7r7Viwba5bQAxdyCKuZuDUvmGvkyWx/1&#13;
RhY07w==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getMt910RequestMt102></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>VV6No9yTWeWfLJO4oeDDqdwseeE=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Mnox1v8qex6rAcNsV2ZDASsByKmbBtdO8WopdJfiU+Ug2qAyBmEK2WSjW0BgUw7hQVdlUTJUMDvd&#13;
m8QvIBaRYsgTs7l2CfdjYhGCpVHha8oN3zLTyDkPpA32jm/rFxEGPFI8jKlylDQybVlK5DtsVf0D&#13;
uZ3Gd6eF2mPnIl/Hs4eYq7VBOSSsrlE4tx2SEicbCYV/fFxT2LFYjONQjI6d3rXT/njQ/cXYhraS&#13;
G6PvoU8kMX3E7xxg7f7TaEBZA3o6bVOxNpTW4pnCPhWiie4qQ3rvoVrTnPeixH0QvyMocDJ//AoN&#13;
1MsUWYkFYfJB+oDI4ZwXyVRl+lPDpD4fKIq54A==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>